---
kind: other
id: Methods.T:Autodesk.Revit.DB.UpdaterData
source: html/7fa4161b-49a3-f6a4-baa6-a8577bf5f3d6.htm
---
# UpdaterData Methods

Returns set of elements newly added to the document.
 This set is mutually exclusive of elements returned by getDeletedElementIds() and getModifiedElementIds().